# Pandas

Pandas is an open source Python package that is most widely used for data science/data analysis and machine learning tasks. 

It is built on top of another package named Numpy, which provides support for multi-dimensional arrays.

Data cleansing

Data fill

Data normalization

Merges and joins

Data visualization

Statistical analysis

Data inspection

Loading and saving data'

# What is a DataFrame?

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

### Creaing a dataframe

pd.dataframe(data)

In [2]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

In [3]:
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

# Locate Row

### loc

Pandas use the  attribute to return one or more specified row(s)

In [5]:
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [6]:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

# Named Indexes

### index

With the  argument, we can name your own indexes.

We can locate these indexex using loc attribute

In [7]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [8]:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

# Load Files Into a DataFrame

### read_csv:
To load csv files

In [15]:
df = pd.read_csv('business-operations-survey-2020-covid-19-csv.csv',encoding = "ISO-8859-1", engine='python')
print(df)

                                             description  \
0       Business status Alert Level 4: Fully operational
1       Business status Alert Level 4: Fully operational
2       Business status Alert Level 4: Fully operational
3       Business status Alert Level 4: Fully operational
4       Business status Alert Level 4: Fully operational
...                                                  ...
10053  Reasons why you expect COVID-19 pandemic to ch...
10054  Reasons why you expect COVID-19 pandemic to ch...
10055  Reasons why you expect COVID-19 pandemic to ch...
10056  Reasons why you expect COVID-19 pandemic to ch...
10057  Reasons why you expect COVID-19 pandemic to ch...

                               industry  level             size line_code  \
0                                 total      0   619 employees  C0301.01
1                                 total      0  2049 employees  C0301.01
2                                 total      0  5099 employees  C0301.01
3                                 total      0   100+ employees  C0301.01
4      Agriculture, forestry, & fishing      1            total  C0301.01
...                                 ...    ...              ...       ...
10053              Education & training      1            total     C2309
10054   Health care & social assistance      1            total     C2309
10055        Arts & recreation services      1            total     C2309
10056                    Other services      1            total     C2309
10057                             total      0            total     C2309

       value
0       6054
1       1650
2        735
3        711
4       2175
...      ...
10053     21
10054     27
10055      0
10056     12
10057    231

[10058 rows x 6 columns]

In [16]:
len(df)

10058

In [17]:
df.columns

Index(['description', 'industry', 'level', 'size', 'line_code', 'value'], dtype='object')

## head()
  Can take a paramater , returns the first number of those many rows . if no parameter shows 5 rows by default
  
## tail()
  Can take a paramater , returns the last number of those many rows . if no parameter , shows  5 rows by default

In [18]:
df.head()

,description,industry,level,size,line_code,value
0,Business status Alert Level 4: Fully operational,total,0,619 employees,C0301.01,6054
1,Business status Alert Level 4: Fully operational,total,0,2049 employees,C0301.01,1650
2,Business status Alert Level 4: Fully operational,total,0,5099 employees,C0301.01,735
3,Business status Alert Level 4: Fully operational,total,0,100+ employees,C0301.01,711
4,Business status Alert Level 4: Fully operational,"Agriculture, forestry, & fishing",1,total,C0301.01,2175

In [19]:
df.head(10)

,description,industry,level,size,line_code,value
0,Business status Alert Level 4: Fully operational,total,0,619 employees,C0301.01,6054
1,Business status Alert Level 4: Fully operational,total,0,2049 employees,C0301.01,1650
2,Business status Alert Level 4: Fully operational,total,0,5099 employees,C0301.01,735
3,Business status Alert Level 4: Fully operational,total,0,100+ employees,C0301.01,711
4,Business status Alert Level 4: Fully operational,"Agriculture, forestry, & fishing",1,total,C0301.01,2175
5,Business status Alert Level 4: Fully operational,Agriculture,2,total,C0301.01,1839
6,Business status Alert Level 4: Fully operational,Commercial fishing,2,total,C0301.01,18
7,Business status Alert Level 4: Fully operational,Forestry & logging,2,total,C0301.01,6
8,Business status Alert Level 4: Fully operational,"Agriculture, forestry, & fishing support services",2,total,C0301.01,312
9,Business status Alert Level 4: Fully operational,Mining,1,total,C0301.01,18

In [20]:
df.tail()

,description,industry,level,size,line_code,value
10053,Reasons why you expect COVID-19 pandemic to ch...,Education & training,1,total,C2309,21
10054,Reasons why you expect COVID-19 pandemic to ch...,Health care & social assistance,1,total,C2309,27
10055,Reasons why you expect COVID-19 pandemic to ch...,Arts & recreation services,1,total,C2309,0
10056,Reasons why you expect COVID-19 pandemic to ch...,Other services,1,total,C2309,12
10057,Reasons why you expect COVID-19 pandemic to ch...,total,0,total,C2309,231

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10058 entries, 0 to 10057
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   description  10058 non-null  object
 1   industry     10058 non-null  object
 2   level        10058 non-null  int64
 3   size         10058 non-null  object
 4   line_code    10058 non-null  object
 5   value        10058 non-null  int64
dtypes: int64(2), object(4)
memory usage: 471.6+ KB

In [22]:
df.describe()

              level         value
count  10058.000000  10058.000000
mean       1.404255    784.425432
std        0.673531   2810.686063
min        0.000000      0.000000
25%        1.000000     24.000000
50%        2.000000    108.000000
75%        2.000000    453.000000
max        2.000000  43902.000000

# Slicing Row and columns

In [23]:
df[1:6]

,description,industry,level,size,line_code,value
1,Business status Alert Level 4: Fully operational,total,0,2049 employees,C0301.01,1650
2,Business status Alert Level 4: Fully operational,total,0,5099 employees,C0301.01,735
3,Business status Alert Level 4: Fully operational,total,0,100+ employees,C0301.01,711
4,Business status Alert Level 4: Fully operational,"Agriculture, forestry, & fishing",1,total,C0301.01,2175
5,Business status Alert Level 4: Fully operational,Agriculture,2,total,C0301.01,1839

In [24]:
df[1:6][['industry' , 'level']]

                           industry  level
1                             total      0
2                             total      0
3                             total      0
4  Agriculture, forestry, & fishing      1
5                       Agriculture      2

In [25]:
df.industry

0                                   total
1                                   total
2                                   total
3                                   total
4        Agriculture, forestry, & fishing
                       ...
10053                Education & training
10054     Health care & social assistance
10055          Arts & recreation services
10056                      Other services
10057                               total
Name: industry, Length: 10058, dtype: object

In [26]:
df.industry.head(5)

0                               total
1                               total
2                               total
3                               total
4    Agriculture, forestry, & fishing
Name: industry, dtype: object

# Dropping a column
### drop[]

Python looks for rows by default

We must provide axis as 1 for dropping coloumns

In [30]:
df.drop(['industry'],axis=1)

,description,level,size,line_code,value
0,Business status Alert Level 4: Fully operational,0,619 employees,C0301.01,6054
1,Business status Alert Level 4: Fully operational,0,2049 employees,C0301.01,1650
2,Business status Alert Level 4: Fully operational,0,5099 employees,C0301.01,735
3,Business status Alert Level 4: Fully operational,0,100+ employees,C0301.01,711
4,Business status Alert Level 4: Fully operational,1,total,C0301.01,2175
...,...,...,...,...,...
10053,Reasons why you expect COVID-19 pandemic to ch...,1,total,C2309,21
10054,Reasons why you expect COVID-19 pandemic to ch...,1,total,C2309,27
10055,Reasons why you expect COVID-19 pandemic to ch...,1,total,C2309,0
10056,Reasons why you expect COVID-19 pandemic to ch...,1,total,C2309,12
10057,Reasons why you expect COVID-19 pandemic to ch...,0,total,C2309,231